# DSIR SQL Technical Interview Practice
-----
Questions from an undisclosed company’s technical interview for “Business Intelligence Manager”, courtesy of a DSI alumn  
Solutions by: Kelly Slatery

In [2]:
import pandas as pd
from pandasql import sqldf

## Tables

In [3]:
EMPLOYEE = pd.DataFrame({
    'EMPLOYEE_ID': [601, 602, 603, 604, 605, 606],
    'FIRSTNAME': ['John', 'Bill', 'Mark', 'Lynda', 'Abby', 'Alex'],
    'LASTNAME': ['Smith', 'Wright', 'Jones', 'Rossi', 'Azuelo', 'Garcia'],
    'LOCATION' : ['Atlanta', 'Houston', 'Boston', 'Atlanta', 'Dallas', 'Dallas'],
    'TITLE' : ['Executive', 'Lead', 'Executive', 'Manager', 'Associate', 'Associate']    
})

In [4]:
COMPENSATION = pd.DataFrame({
    'EMPLOYEE_ID': [601, 602, 603, 604, 605, 606],
    'SALARY' : [50000, 30000, 45000, 40000, 25000, 25000],
    'BONUS' : [5000, 3000, 4000, 4000, 0, 0],
    'ANNUAL_PTO_DAYS' : [20, 14, 20, 16, 10, 10],
    'RETIRE_MATCHING' : ['Y', 'N', 'Y', 'Y', 'N', 'N']    
})

In [5]:
EMPLOYEE

   EMPLOYEE_ID FIRSTNAME LASTNAME LOCATION      TITLE
0          601      John    Smith  Atlanta  Executive
1          602      Bill   Wright  Houston       Lead
2          603      Mark    Jones   Boston  Executive
3          604     Lynda    Rossi  Atlanta    Manager
4          605      Abby   Azuelo   Dallas  Associate
5          606      Alex   Garcia   Dallas  Associate

In [6]:
COMPENSATION

   EMPLOYEE_ID  SALARY  BONUS  ANNUAL_PTO_DAYS RETIRE_MATCHING
0          601   50000   5000               20               Y
1          602   30000   3000               14               N
2          603   45000   4000               20               Y
3          604   40000   4000               16               Y
4          605   25000      0               10               N
5          606   25000      0               10               N

## Queries

#### 1. Using the employee and the compensation tables above – write a query that will provide a count of non-executive employees by the RETIRE_MATCHING column.

In [ ]:
sql = """

"""

df = sqldf(sql)
df.head()

#### 2. Write a SQL Query To Fetch Unique Values Of TITLE From EMPLOYEE Table.

In [ ]:
sql = """

"""

df = sqldf(sql)
df.head()

#### 3. List the 4 types of joins and basic description of each.

#### 4.  Using the query below answer the following questions about the result set:
```
SELECT E.LOCATION, SUM(C.SALARY) AS SALARY
FROM EMPLOYEE E
,COMPENSATION C
WHERE E.EMPLOYEE_ID = C.EMPLOYEE_ID
AND E.TITLE <> ‘EXECUTIVE’
GROUP BY E.LOCATION
```
 
- What is the resulting sum of Salary for Atlanta?
- How many total columns are returned?

#### 5. Write a SQL query to return the employee first and lastname with the same salary (without hard coding the salary amount).

In [ ]:
sql = """

"""

df = sqldf(sql)
df.head()

#### 6. Write a SQL query to return employees firstname, title, and location - whose SALARY lies between (inclusive) 30000 and 45000.

In [ ]:
sql = """

"""

df = sqldf(sql)
df.head()